StephenbDennis/room_tracker/firmware/sdkconfig.defaults
# Target
CONFIG_IDF_TARGET="esp32s3"

# --- Bluetooth: NimBLE only (the S3 has no classic BT) ---
CONFIG_BT_ENABLED=y
CONFIG_BT_NIMBLE_ENABLED=y
CONFIG_BT_NIMBLE_ROLE_PERIPHERAL=y
CONFIG_BT_NIMBLE_ROLE_BROADCASTER=y
CONFIG_BT_NIMBLE_ROLE_CENTRAL=n
CONFIG_BT_NIMBLE_ROLE_OBSERVER=n
CONFIG_BT_NIMBLE_MAX_CONNECTIONS=1

# Large MTU keeps config chunking cheap and lets a full track frame ride in
# a single notification.
CONFIG_BT_NIMBLE_ATT_PREFERRED_MTU=517
CONFIG_BT_NIMBLE_GATT_MAX_PROCS=8

# A config write is handled synchronously on the host task: cJSON parses the
# blob recursively and NVS commits it, both from inside the GATT callback. The
# 4 kB default leaves no margin for that.
CONFIG_BT_NIMBLE_HOST_TASK_STACK_SIZE=6144

# --- WiFi / MQTT ---
# Only used when the config carries credentials; with reporting off the station
# is never started and the radio stays BLE-only.
CONFIG_ESP_WIFI_ENABLED=y
CONFIG_ESP_WIFI_STATIC_RX_BUFFER_NUM=8
CONFIG_ESP_WIFI_DYNAMIC_RX_BUFFER_NUM=16

# --- BLE / WiFi coexistence ---
# Both share one radio on the S3. BLE is the configuration path and must keep
# working while WiFi is associating, so the scheduler has to arbitrate.
CONFIG_ESP_COEX_SW_COEXIST_ENABLE=y

# --- Partitions ---
# WiFi, lwIP and the MQTT client do not fit alongside NimBLE in the 1 MB
# single-app partition. The "large" layout gives 1.5 MB, which needs 1.625 MB
# of flash in total -- fine on 2 MB, and this must be raised further if
# CONFIG_ESPTOOLPY_FLASHSIZE is wrong for the board.
CONFIG_PARTITION_TABLE_SINGLE_APP_LARGE=y

# --- UART ---
# 256000 baud from the LD2450; the default REF_TICK source cannot divide to it
# accurately, so leave the clock on APB.
CONFIG_ESP_CONSOLE_UART_BAUDRATE=115200

# --- misc ---
CONFIG_FREERTOS_HZ=1000
CONFIG_ESP_MAIN_TASK_STACK_SIZE=4096
CONFIG_COMPILER_OPTIMIZATION_SIZE=y
CONFIG_LOG_DEFAULT_LEVEL_INFO=y
